cfe llm/Catalogs/AI_КартыИзвлечения.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_КартыИзвлечения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискПоНаименованию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_МестаЗапускаСценариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_МестаЗапускаСценариев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйЗапрос</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНесколькоОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаИзвлечения</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_КартыИзвлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ВидДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_РежимВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Уточнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУточнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидУточнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСодержимого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИмениФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередаватьСодержимое</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыКонтекста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидСравненияОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Сценарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляСтаройОчереди</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазбораВложений</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СпособРазбораВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыЗнаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаборЗнаний</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_НаборыЗнаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_ПакетыСценариев/Ext/Module.bsl
// Перенос настроенного сценария между базами.
//
// Сценарий живет в данных, а не в коде: место запуска, карта извлечения,
// уточнения, отборы и параметры действия — это справочники. Поэтому перенести
// его можно, не обновляя конфигурацию, — пакетом.
//
// Пакет — zip: manifest.json с описанием настройки и файлы внешних обработок,
// которые в этой настройке участвуют. Ссылок на объекты чужой базы в манифесте
// нет: все связи выражены именами и полными именами метаданных, иначе пакет был
// бы переносим только между копиями одной базы.
//
// Чего в пакете нет намеренно:
//   провайдеров, ключей и моделей — это среда и секреты;
//   агента и профилей доступа — это права, их выдает администратор базы;
//   прикладных данных — пакет описывает настройку, а не документы.
//
// Загрузка меняет поведение системы данными: новый промт модели плюс новый
// белый список реквизитов, которые разрешено писать. По последствиям это ближе
// к установке расширения, чем к вводу справочника, поэтому право на загрузку —
// административное, а каждая загрузка попадает в журнал регистрации.

#Область ПрограммныйИнтерфейс

// Собирает пакет по местам запуска.
//
// МестаЗапуска — массив ссылок либо одна ссылка.
// Возвращает структуру: Данные (ДвоичныеДанные), Имя (строка), Состав (массив
// строк — что вошло), Предупреждения (массив строк).
Функция Выгрузить(Знач МестаЗапуска) Экспорт

	ПроверитьПраво("выгрузку");

	Результат = Новый Структура("Данные,Имя,Состав,Предупреждения",
		Неопределено, "", Новый Массив, Новый Массив);

	Места = НормализоватьСсылки(МестаЗапуска);
	Если Места.Количество() = 0 Тогда
		ВызватьИсключение "Не указано ни одного места запуска.";
	КонецЕсли;

	// Схема 2: разговор, данные объекта, обновление строк по номеру, выбор из
	// существующих, этапы обработки и видимость. Старая загрузка такой пакет
	// отклонит по номеру схемы, а не примет молча без половины настройки.
	Манифест = Новый Структура;
	Манифест.Вставить("schema", ВерсияСхемыПакета());
	Манифест.Вставить("exported_at", Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-ddTHH:mm:ss"));
	Манифест.Вставить("launch_places", Новый Массив);
	Манифест.Вставить("extraction_maps", Новый Массив);
	Манифест.Вставить("scenarios", Новый Массив);
	Манифест.Вставить("processings", Новый Массив);

	Карты = Новый Массив;
	Сценарии = Новый Массив;
	ИменаОбработок = Новый Массив;

	Для Каждого Место Из Места Цикл
		Данные = Место.ПолучитьОбъект();
		Манифест.launch_places.Добавить(ОписаниеМеста(Данные));
		Результат.Состав.Добавить("Место запуска: " + Строка(Место));

		Если ЗначениеЗаполнено(Данные.КартаИзвлечения) И Карты.Найти(Данные.КартаИзвлечения) = Неопределено Тогда
			Карты.Добавить(Данные.КартаИзвлечения);
		КонецЕсли;
		Если ЗначениеЗаполнено(Данные.Сценарий) И Сценарии.Найти(Данные.Сценарий) = Неопределено Тогда
			Сценарии.Добавить(Данные.Сценарий);
		КонецЕсли;
		ИмяОбработки = СокрЛП(Данные.Обработчик);
		Если ЗначениеЗаполнено(ИмяОбработки) И ИменаОбработок.Найти(ИмяОбработки) = Неопределено Тогда
			ИменаОбработок.Добавить(ИмяОбработки);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Карта Из Карты Цикл
		Манифест.extraction_maps.Добавить(ОписаниеКарты(Карта.ПолучитьОбъект()));
		Результат.Состав.Добавить("Карта извлечения: " + Строка(Карта));
	КонецЦикла;

	Для Каждого Сценарий Из Сценарии Цикл
		Манифест.scenarios.Добавить(ОписаниеСценария(Сценарий.ПолучитьОбъект()));
		Результат.Состав.Добавить("Сценарий: " + Строка(Сценарий));
	КонецЦикла;

	// Каталог для сборки zip: писать архив мимо файловой системы платформа
	// не умеет, поэтому работаем во временном каталоге и убираем его за собой.
	КаталогСборки = КаталогВременныхФайлов() + ПолучитьРазделительПути()
		+ "ai-package-" + Строка(Новый УникальныйИдентификатор());
	СоздатьКаталог(КаталогСборки);

	Попытка
		Для Каждого ИмяОбработки Из ИменаОбработок Цикл
			Файл = ВыгрузитьОбработку(ИмяОбработки, КаталогСборки, Результат.Предупреждения);
			Если Файл = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Манифест.processings.Добавить(Файл);
			Результат.Состав.Добавить("Обработка: " + ИмяОбработки);
		КонецЦикла;

		ПутьМанифеста = КаталогСборки + ПолучитьРазделительПути() + "manifest.json";
		Запись = Новый ЗаписьJSON;
		Запись.ОткрытьФайл(ПутьМанифеста, "UTF-8", Ложь, Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб));
		ЗаписатьJSON(Запись, Манифест);
		Запись.Закрыть();

		ПутьАрхива = КаталогСборки + ".zip";
		Архив = Новый ЗаписьZipФайла(ПутьАрхива);
		Архив.Добавить(КаталогСборки + ПолучитьРазделительПути() + "*",
			РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		Архив.Записать();

		Результат.Данные = Новый ДвоичныеДанные(ПутьАрхива);
		Результат.Имя = ИмяФайлаПакета(Места);
		УдалитьФайлы(ПутьАрхива);
	Исключение
		УдалитьКаталогТихо(КаталогСборки);
		ВызватьИсключение;
	КонецПопытки;
	УдалитьКаталогТихо(КаталогСборки);

	ЗаписатьВЖурнал("Выгрузка", СтрСоединить(Результат.Состав, "; "));

	Возврат Результат;

КонецФункции

// Загружает пакет.
//
// Источник — адрес двоичных данных во временном хранилище либо сами
// ДвоичныеДанные: через хранилище приходит файл из формы, напрямую — вызов из
// кода и внешнего соединения. Пакет — zip с manifest.json и файлами обработок
// либо сам manifest.json: так его может написать агент или человек, если
// обработок в настройке нет.
//
// Параметры — необязательная Структура:
//   ОбразецСценария - СправочникСсылка.AI_Сценарии - откуда взять агента и
//                     модель для сценария, которого в базе нет. Пусто — самый
//                     ходовой рабочий сценарий, как в мастере нового действия.
//
// Возвращает структуру: Загружено (массив строк), Предупреждения (массив строк),
// Ошибки (массив строк). Непустые Ошибки означают, что не загружено ничего:
// частичная загрузка настройки хуже отказа — половина сценария выглядит
// работающей, но ведет себя иначе. Поэтому пакет пишется одной транзакцией, и
// сбой записи любого объекта отменяет запись всех остальных.
//
// Вызванная внутри транзакции вызывающего кода, загрузка о сбое записи
// сообщает исключением, а не Ошибками: после отмены вложенной транзакции
// внешнюю уже не зафиксировать, и продолжать в ней работу бессмысленно.
Функция Загрузить(Знач Источник, Знач Параметры = Неопределено) Экспорт

	ПроверитьПраво("загрузку");
	Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
		Параметры = Новый Структура;
	КонецЕсли;

	Результат = Новый Структура("Загружено,Предупреждения,Ошибки",
		Новый Массив, Новый Массив, Новый Массив);

	Если ТипЗнч(Источник) = Тип("ДвоичныеДанные") Тогда
		Данные = Источник;
	Иначе
		Данные = ПолучитьИзВременногоХранилища(Источник);
	КонецЕсли;
	Если ТипЗнч(Данные) <> Тип("ДвоичныеДанные") Тогда
		Результат.Ошибки.Добавить("Пакет не найден: передан ни файл, ни адрес хранилища.");
		Возврат Результат;
	КонецЕсли;

	КаталогРазбора = КаталогВременныхФайлов() + ПолучитьРазделительПути()
		+ "ai-import-" + Строка(Новый УникальныйИдентификатор());
	СоздатьКаталог(КаталогРазбора);

	// Разбор и проверки — до транзакции: архив, JSON и контрольные суммы к базе
	// отношения не имеют. Файлы обработок к записи уже прочитаны в память, и
	// каталог разбора убирается до первой записи.
	Манифест = Неопределено;
	Загрузка = Неопределено;
	Попытка
		Манифест = ПрочитатьМанифест(Данные, КаталогРазбора, Результат);
		Если Результат.Ошибки.Количество() = 0 Тогда
			ПроверитьМанифест(Манифест, Результат);
		КонецЕсли;
		Если Результат.Ошибки.Количество() = 0 Тогда
			Загрузка = ПодготовитьЗагрузку(Манифест, КаталогРазбора, Параметры, Результат);
		КонецЕсли;
	Исключение
		Результат.Ошибки.Добавить("Не удалось разобрать пакет: " + ОписаниеОшибки());
	КонецПопытки;

	УдалитьКаталогТихо(КаталогРазбора);

	ПодробностиСбоя = "";
	Если Результат.Ошибки.Количество() = 0 Тогда
		Попытка
			ЗагрузитьСодержимое(Манифест, Загрузка, Результат);
		Исключение
			// Транзакция вызывающего кода: см. описание функции.
			Если ТранзакцияАктивна() Тогда
				ВызватьИсключение;
			КонецЕсли;
			// Транзакция отменена: из пакета в базе не осталось ничего, и отчет
			// не должен перечислять созданное и обновленное.
			Сбой = ИнформацияОбОшибке();
			Результат.Загружено.Очистить();
			Результат.Ошибки.Добавить(СтрШаблон("Не удалось записать %1 — загрузка отменена,"
				+ " из пакета не записано ничего. Причина: %2", Загрузка.Шаг, КраткоеПредставлениеОшибки(Сбой)));
			ПодробностиСбоя = Символы.ПС + ПодробноеПредставлениеОшибки(Сбой);
		КонецПопытки;
	КонецЕсли;

	Если Результат.Ошибки.Количество() = 0 Тогда
		ЗаписатьВЖурнал("Загрузка", СтрСоединить(Результат.Загружено, "; "));
	Иначе
		ЗаписатьВЖурнал("Загрузка отклонена", СтрСоединить(Результат.Ошибки, "; ") + ПодробностиСбоя);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Доступна ли работа с пакетами текущему пользователю.
Функция ПакетыДоступны() Экспорт

	Возврат ПравоДоступа("Администрирование", Метаданные);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПраво(Действие)

	Если Не ПакетыДоступны() Тогда
		ВызватьИсключение "Права на " + Действие + " пакетов сценариев нет:"
			+ " пакет меняет поведение системы, и это административное действие.";
	КонецЕсли;

КонецПроцедуры

Функция НормализоватьСсылки(Знач Значение)

	Результат = Новый Массив;
	Если ТипЗнч(Значение) = Тип("Массив") Или ТипЗнч(Значение) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Элемент Из Значение Цикл
			Если ЗначениеЗаполнено(Элемент) Тогда
				Результат.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(Значение) Тогда
		Результат.Добавить(Значение);
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ОписаниеМеста(Место)

	Описание = Новый Структура;
	Описание.Вставить("name", Строка(Место.Наименование));
	Описание.Вставить("scenario", ?(ЗначениеЗаполнено(Место.Сценарий), Строка(Место.Сценарий), ""));
	Описание.Вставить("extraction_map", ?(ЗначениеЗаполнено(Место.КартаИзвлечения), Строка(Место.КартаИзвлечения), ""));
	Описание.Вставить("place_type", Строка(Место.ТипМеста));
	Описание.Вставить("metadata_name", Строка(Место.ПолноеИмяМетаданных));
	Описание.Вставить("command_title", Строка(Место.ПредставлениеКоманды));
	Описание.Вставить("description", Строка(Место.Описание));
	Описание.Вставить("initial_prompt", Строка(Место.НачальныйЗапрос));
	Описание.Вставить("order", Число(Место.Порядок));
	Описание.Вставить("allow_many", Булево(Место.РазрешитьНесколькоОбъектов));
	Описание.Вставить("execution_mode", ИмяЗначенияПеречисления(Место.РежимВыполнения));
	Описание.Вставить("action_kind", ИмяЗначенияПеречисления(Место.ВидДействия));
	Описание.Вставить("action_title", Строка(Место.ЗаголовокДействия));
	Описание.Вставить("action_key", Строка(Место.КлючДействия));
	Описание.Вставить("handler", Строка(Место.Обработчик));
	Описание.Вставить("action_method", Строка(Место.МетодДействия));
	Описание.Вставить("check_method", Строка(Место.МетодПроверки));
	Описание.Вставить("prepare_method", Строка(Место.МетодПодготовкиЗапроса));
	Описание.Вставить("after_answer_method", Строка(Место.МетодПослеОтвета));
	Описание.Вставить("after_action_method", Строка(Место.МетодПослеДействия));
	Описание.Вставить("dialog_mode", Булево(Место.РежимДиалога));

	ДанныеОбъекта = Новый Массив;
	Для Каждого Строка Из Место.ДанныеОбъекта Цикл
		ДанныеОбъекта.Добавить(Новый Структура("tabular_section,attribute",
			Строка(Строка.ТабличнаяЧасть), Строка(Строка.ПутьРеквизита)));
	КонецЦикла;
	Описание.Вставить("object_data", ДанныеОбъекта);

	Видимость = Новый Массив;
	Для Каждого Строка Из Место.Видимость Цикл
		Видимость.Добавить(Новый Структура("kind,name",
			Строка(Строка.ВидУсловия), Строка(Строка.Имя)));
	КонецЦикла;
	Описание.Вставить("visibility", Видимость);

	Уточнения = Новый Массив;
	Для Каждого Строка Из Место.Уточнения Цикл
		Шаг = Новый Структура;
		Шаг.Вставить("id", Строка(Строка.Идентификатор));
		Шаг.Вставить("title", Строка(Строка.Представление));
		Шаг.Вставить("kind", ИмяЗначенияПеречисления(Строка.ВидУточнения));
		Шаг.Вставить("source", Строка(Строка.ИсточникДанных));
		Шаг.Вставить("link_attribute", Строка(Строка.РеквизитСвязи));
		Шаг.Вставить("title_attribute", Строка(Строка.РеквизитПредставления));
		Шаг.Вставить("content_attribute", Строка(Строка.РеквизитСодержимого));
		Шаг.Вставить("file_name_attribute", Строка(Строка.РеквизитИмениФайла));
		Шаг.Вставить("filter_attribute", Строка(Строка.ОтборРеквизит));
		Шаг.Вставить("filter_value", Строка(Строка.ОтборЗначение));
		Шаг.Вставить("send_content", Булево(Строка.ПередаватьСодержимое));
		Шаг.Вставить("required", Булево(Строка.Обязательное));
		Шаг.Вставить("hint", Строка(Строка.Подсказка));
		Уточнения.Добавить(Шаг);
	КонецЦикла;
	Описание.Вставить("clarifications", Уточнения);

	Отборы = Новый Массив;
	Для Каждого Строка Из Место.ОтборыКонтекста Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("path", Строка(Строка.ПутьРеквизита));
		Отбор.Вставить("comparison", ИмяЗначенияПеречисления(Строка.ВидСравнения));
		Отбор.Вставить("value", Строка(Строка.Значение));
		Отборы.Добавить(Отбор);
	КонецЦикла;
	Описание.Вставить("context_filters", Отборы);

	Параметры = Новый Массив;
	Для Каждого Строка Из Место.ПараметрыДействия Цикл
		Параметр = Новый Структура;
		Параметр.Вставить("name", Строка(Строка.Имя));
		Параметр.Вставить("value_type", ИмяЗначенияПеречисления(Строка.ТипЗначения));
		Параметр.Вставить("value", Строка(Строка.Значение));
		Параметр.Вставить("reference_type", Строка(Строка.ТипСсылки));
		Параметры.Добавить(Параметр);
	КонецЦикла;
	Описание.Вставить("action_parameters", Параметры);

	Возврат Описание;

КонецФункции

Функция ОписаниеКарты(Карта)

	Описание = Новый Структура;
	Описание.Вставить("name", Строка(Карта.Наименование));
	Описание.Вставить("metadata_name", Строка(Карта.ПолноеИмяМетаданных));
	Описание.Вставить("description", Строка(Карта.Описание));
	Описание.Вставить("replace_rows", Булево(Карта.ЗаменятьСтрокиТабличныхЧастей));
	Описание.Вставить("update_rows_by_number", Булево(Карта.ОбновлятьСтрокиПоНомеру));

	Поля = Новый Массив;
	Для Каждого Строка Из Карта.Поля Цикл
		Поле = Новый Структура;
		Поле.Вставить("key", Строка(Строка.Ключ));
		Поле.Вставить("title", Строка(Строка.Представление));
		Поле.Вставить("value_type", ИмяЗначенияПеречисления(Строка.ТипЗначения));
		Поле.Вставить("reference_type", Строка(Строка.ТипСсылки));
		Поле.Вставить("attribute_path", Строка(Строка.ПутьРеквизита));
		Поле.Вставить("tabular_section", Строка(Строка.ТабличнаяЧасть));
		Поле.Вставить("extra_attribute", Строка(Строка.ДополнительныйРеквизит));
		Поле.Вставить("search_by_title", Булево(Строка.ПоискПоНаименованию));
		Поле.Вставить("choose_from_list", Булево(Строка.ВыбиратьИзСписка));
		Поле.Вставить("required", Булево(Строка.Обязательное));
		Поле.Вставить("hint", Строка(Строка.Подсказка));
		Поля.Добавить(Поле);
	КонецЦикла;
	Описание.Вставить("fields", Поля);

	Возврат Описание;

КонецФункции

// Сценарий переносится без среды: провайдер, модель и агент остаются за
// администратором принимающей базы — это ключи и права, а не настройка.
Функция ОписаниеСценария(Сценарий)

	Описание = Новый Структура;
	Описание.Вставить("name", Строка(Сценарий.Наименование));
	Описание.Вставить("response_schema", Строка(Сценарий.СхемаОтветаJSON));
	Описание.Вставить("handler_code", Строка(Сценарий.КодОбработчика));
	Описание.Вставить("contract_version", Строка(Сценарий.ВерсияКонтракта));
	Описание.Вставить("allow_retry", Булево(Сценарий.РазрешитьПовтор));
	Описание.Вставить("max_attempts", Число(Сценарий.МаксимумПопыток));
	Описание.Вставить("attachment_parse_mode",
		ИмяЗначенияПеречисления(Сценарий.СпособРазбораВложений));
	Возврат Описание;

КонецФункции

Функция ИмяЗначенияПеречисления(Значение)

	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат "";
	КонецЕсли;
	МетаданныеПеречисления = Метаданные.НайтиПоТипу(ТипЗнч(Значение));
	Если МетаданныеПеречисления = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Индекс = Перечисления[МетаданныеПеречисления.Имя].Индекс(Значение);
	Возврат МетаданныеПеречисления.ЗначенияПеречисления[Индекс].Имя;

КонецФункции

Функция ЗначениеПеречисленияПоИмени(ИмяПеречисления, ИмяЗначения)

	Если Не ЗначениеЗаполнено(ИмяЗначения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	МетаданныеПеречисления = Метаданные.Перечисления.Найти(ИмяПеречисления);
	Если МетаданныеПеречисления = Неопределено
		Или МетаданныеПеречисления.ЗначенияПеречисления.Найти(ИмяЗначения) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Перечисления[ИмяПеречисления][ИмяЗначения];

КонецФункции

// «ЗаполнитьФорму, ЗаписатьОбъект, …» — для сообщения о неизвестном значении.
Функция ИменаЗначенийПеречисления(ИмяПеречисления)

	Имена = Новый Массив;
	Для Каждого Значение Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл
		Имена.Добавить(Значение.Имя);
	КонецЦикла;
	Возврат СтрСоединить(Имена, ", ");

КонецФункции

// Достает файл зарегистрированной обработки. Реестр БСП тут — именно реестр:
// подсистема читает справочник запросом и не зависит от его прикладного API.
Функция ВыгрузитьОбработку(ИмяОбработки, КаталогСборки, Предупреждения)

	// «Обработка.<Имя>» — часть конфигурации: в пакет она не едет, в
	// принимающей базе она есть вместе с конфигурацией или ее нет совсем.
	Если СтрНачинаетсяС(ИмяОбработки, "Обработка.") Или СтрНачинаетсяС(ИмяОбработки, "DataProcessor.") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено Тогда
		Предупреждения.Добавить("В конфигурации нет реестра дополнительных обработок:"
			+ " обработка «" + ИмяОбработки + "» в пакет не вошла.");
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|  Обработки.ХранилищеОбработки КАК Хранилище,
		|  Обработки.Версия КАК Версия
		|ИЗ Справочник.ДополнительныеОтчетыИОбработки КАК Обработки
		|ГДЕ НЕ Обработки.ПометкаУдаления
		|  И (Обработки.Наименование = &Имя ИЛИ Обработки.ИмяОбъекта = &Имя)");
	Запрос.УстановитьПараметр("Имя", ИмяОбработки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Предупреждения.Добавить("Обработка «" + ИмяОбработки + "» не зарегистрирована,"
			+ " в пакет вошло только ее имя.");
		Возврат Неопределено;
	КонецЕсли;

	Двоичные = Выборка.Хранилище.Получить();
	Если ТипЗнч(Двоичные) <> Тип("ДвоичныеДанные") Тогда
		Предупреждения.Добавить("У обработки «" + ИмяОбработки + "» пустое хранилище.");
		Возврат Неопределено;
	КонецЕсли;

	ИмяФайла = ТранслитерироватьИмя(ИмяОбработки) + ".epf";
	Двоичные.Записать(КаталогСборки + ПолучитьРазделительПути() + ИмяФайла);

	Описание = Новый Структура;
	Описание.Вставить("name", ИмяОбработки);
	Описание.Вставить("file", ИмяФайла);
	Описание.Вставить("version", Строка(Выборка.Версия));
	Описание.Вставить("sha256", ХешФайла(КаталогСборки + ПолучитьРазделительПути() + ИмяФайла));
	Возврат Описание;

КонецФункции

Функция ХешФайла(Путь)

	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.ДобавитьФайл(Путь);
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));

КонецФункции

// Имена обработок и сценариев содержат пробелы, двоеточия и кириллицу — в имя
// файла внутри архива они не годятся. Кириллицу переводим в латиницу, а не
// заменяем подчеркиваниями: иначе имена файлов перестают что-либо значить и
// пакет с двумя обработками выглядит как набор одинаковых заглушек.
Функция ТранслитерироватьИмя(Знач Имя)

	Кириллица = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	Латиница = Новый Массив;
	Для Каждого Замена Из СтрРазделить(
		"a,b,v,g,d,e,e,zh,z,i,y,k,l,m,n,o,p,r,s,t,u,f,h,c,ch,sh,sch,,y,,e,yu,ya", ",", Истина) Цикл
		Латиница.Добавить(Замена);
	КонецЦикла;

	Результат = "";
	Для Индекс = 1 По СтрДлина(Имя) Цикл
		Символ = Сред(Имя, Индекс, 1);
		Если СтрНайти("abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789", Символ) > 0 Тогда
			Результат = Результат + Символ;
			Продолжить;
		КонецЕсли;
		Позиция = СтрНайти(Кириллица, НРег(Символ));
		Если Позиция > 0 Тогда
			Результат = Результат + Латиница[Позиция - 1];
		Иначе
			Результат = Результат + "_";
		КонецЕсли;
	КонецЦикла;

	Пока СтрНайти(Результат, "__") > 0 Цикл
		Результат = СтрЗаменить(Результат, "__", "_");
	КонецЦикла;
	Результат = СокрЛП(СтрЗаменить(Результат, "_", " "));
	Результат = СтрЗаменить(Результат, " ", "_");

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = "package_" + Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	Возврат Лев(Результат, 60);

КонецФункции

Функция ИмяФайлаПакета(Места)

	Основа = ?(Места.Количество() = 1, Строка(Места[0]), "scenario-package");
	Возврат ТранслитерироватьИмя(Основа) + "-"
		+ Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMdd") + ".zip";

КонецФункции

// Проверка до единой записи: пакет либо применим целиком, либо не применяется.
Процедура ПроверитьМанифест(Манифест, Результат)

	Если ТипЗнч(Манифест) <> Тип("Соответствие") Тогда
		Результат.Ошибки.Добавить("Манифест пакета испорчен.");
		Возврат;
	КонецЕсли;

	Схема = Манифест.Получить("schema");
	Если Схема = Неопределено Или ТипЗнч(Схема) <> Тип("Число")
		Или Схема < 1 Или Схема > ВерсияСхемыПакета() Тогда
		Результат.Ошибки.Добавить("Версия схемы пакета не поддерживается: " + Строка(Схема)
			+ ". Эта база понимает схемы 1–" + Формат(ВерсияСхемыПакета(), "ЧГ=0") + ".");
		Возврат;
	КонецЕсли;

	Места = Манифест.Получить("launch_places");
	Если ТипЗнч(Места) <> Тип("Массив") Или Места.Количество() = 0 Тогда
		Результат.Ошибки.Добавить("В пакете нет мест запуска.");
		Возврат;
	КонецЕсли;

	// Метаданные принимающей конфигурации могут не совпадать с исходной. Молча
	// принять такой пакет нельзя: место запуска будет ссылаться в пустоту, а
	// пользователь увидит это только на живом документе. Пакет пишут и руками,
	// и агентом, поэтому грубые ошибки описания ловятся здесь же, до записи.
	Для Каждого Место Из Места Цикл
		Если ТипЗнч(Место) <> Тип("Соответствие") Тогда
			Результат.Ошибки.Добавить("Место запуска в пакете должно быть объектом JSON.");
			Продолжить;
		КонецЕсли;
		Имя = СокрЛП(Строка(ЗначениеИлиПусто(Место, "name", "")));
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Результат.Ошибки.Добавить("У места запуска не указано имя (name).");
			Продолжить;
		КонецЕсли;
		ТипМеста = СокрЛП(Строка(ЗначениеИлиПусто(Место, "place_type", "")));
		Если СтрРазделить("Объект,Список,Глобально", ",").Найти(ТипМеста) = Неопределено Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Место запуска «%1»: тип места «%2» неизвестен."
				+ " Допустимы «Объект», «Список» и «Глобально».", Имя, ТипМеста));
		КонецЕсли;
		ВидДействия = СокрЛП(Строка(ЗначениеИлиПусто(Место, "action_kind", "")));
		Если ЗначениеЗаполнено(ВидДействия)
			И ЗначениеПеречисленияПоИмени("AI_ВидДействия", ВидДействия) = Неопределено Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Место запуска «%1»: вид действия «%2» неизвестен."
				+ " Допустимы: %3.", Имя, ВидДействия, ИменаЗначенийПеречисления("AI_ВидДействия")));
		КонецЕсли;
		ПолноеИмя = СокрЛП(Строка(Место.Получить("metadata_name")));
		Если ЗначениеЗаполнено(ПолноеИмя) И ПолноеИмя <> "*"
			И Метаданные.НайтиПоПолномуИмени(ПолноеИмя) = Неопределено Тогда
			Результат.Ошибки.Добавить("В конфигурации нет объекта «" + ПолноеИмя
				+ "», на который настроено место запуска «"
				+ Строка(Место.Получить("name")) + "».");
		КонецЕсли;
	КонецЦикла;

	Карты = Манифест.Получить("extraction_maps");
	Если ТипЗнч(Карты) = Тип("Массив") Тогда
		Для Каждого Карта Из Карты Цикл
			ПолноеИмя = СокрЛП(Строка(Карта.Получить("metadata_name")));
			Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда
				Продолжить;
			КонецЕсли;
			ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
			Если ОбъектМетаданных = Неопределено Тогда
				Результат.Ошибки.Добавить("В конфигурации нет объекта «" + ПолноеИмя
					+ "», на который настроена карта «" + Строка(Карта.Получить("name")) + "».");
				Продолжить;
			КонецЕсли;
			Поля = Карта.Получить("fields");
			Если ТипЗнч(Поля) <> Тип("Массив") Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого Поле Из Поля Цикл
				Путь = СокрЛП(Строка(Поле.Получить("attribute_path")));
				ИмяТЧ = СокрЛП(Строка(Поле.Получить("tabular_section")));
				Если Не ЗначениеЗаполнено(Путь) Тогда
					Продолжить;
				КонецЕсли;
				// Колонка табличной части ищется в своей табличной части, а не
				// среди реквизитов шапки: иначе каждая колонка — ложная тревога.
				Если ЗначениеЗаполнено(ИмяТЧ) Тогда
					ОписаниеТЧ = ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяТЧ);
					Если ОписаниеТЧ = Неопределено Тогда
						Результат.Предупреждения.Добавить("У «" + ПолноеИмя + "» нет табличной части «"
							+ ИмяТЧ + "»: поле карты останется нерабочим.");
					ИначеЕсли ОписаниеТЧ.Реквизиты.Найти(Путь) = Неопределено Тогда
						Результат.Предупреждения.Добавить("В табличной части «" + ИмяТЧ + "» объекта «"
							+ ПолноеИмя + "» нет колонки «" + Путь + "»: поле карты останется нерабочим.");
					КонецЕсли;
				ИначеЕсли ОбъектМетаданных.Реквизиты.Найти(Путь) = Неопределено
					И Не ЕстьСтандартныйРеквизит(ОбъектМетаданных, Путь) Тогда
					Результат.Предупреждения.Добавить("У «" + ПолноеИмя + "» нет реквизита «"
						+ Путь + "»: поле карты останется нерабочим.");
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// У коллекции стандартных реквизитов нет метода Найти — только обход.
Функция ЕстьСтандартныйРеквизит(ОбъектМетаданных, Имя)

	Для Каждого Стандартный Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		Если ВРег(Стандартный.Имя) = ВРег(Имя) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

// Манифест пакета: из zip либо голый manifest.json. Неопределено — пакет не
// разобран, причина уже в Результат.Ошибки.
Функция ПрочитатьМанифест(Данные, КаталогРазбора, Результат)

	Если ЭтоАрхив(Данные) Тогда
		ПутьАрхива = КаталогРазбора + ПолучитьРазделительПути() + "package.zip";
		Данные.Записать(ПутьАрхива);
		Архив = Новый ЧтениеZipФайла(ПутьАрхива);
		Архив.ИзвлечьВсе(КаталогРазбора, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		Архив.Закрыть();

		ПутьМанифеста = КаталогРазбора + ПолучитьРазделительПути() + "manifest.json";
		Если Не ФайлСуществует(ПутьМанифеста) Тогда
			Результат.Ошибки.Добавить("В пакете нет manifest.json — это не пакет сценария.");
			Возврат Неопределено;
		КонецЕсли;

		Чтение = Новый ЧтениеJSON;
		Чтение.ОткрытьФайл(ПутьМанифеста);
	Иначе
		// Голый manifest.json: обработок в нем нет и быть не может — файлы
		// обработок ездят только в zip.
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(Данные, КодировкаТекста.UTF8));
	КонецЕсли;
	Манифест = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	Возврат Манифест;

КонецФункции

// Все, что записи нужно из пакета помимо манифеста. Файлы обработок читаются
// и сверяются с контрольной суммой здесь, до транзакции: подмененный файл —
// дефект пакета, и такой пакет не должен дойти до первой записи.
//
// Шаг — что пишется сейчас, в винительном падеже («карту …», «место запуска
// …»): по нему отказ называет объект, на котором запись сорвалась.
Функция ПодготовитьЗагрузку(Манифест, КаталогРазбора, Параметры, Результат)

	Загрузка = Новый Структура("Параметры,ОписанияСценариев,ФайлыОбработок,Образец,Шаг",
		Параметры, Новый Соответствие, Новый Массив, Неопределено, "пакет");

	// Настройки сценариев из пакета — по имени: недостающий сценарий создается
	// по образцу, а настройки ответа берутся отсюда.
	Сценарии = Манифест.Получить("scenarios");
	Если ТипЗнч(Сценарии) = Тип("Массив") Тогда
		Для Каждого ОписаниеСценария Из Сценарии Цикл
			Загрузка.ОписанияСценариев.Вставить(СокрЛП(Строка(ОписаниеСценария.Получить("name"))),
				ОписаниеСценария);
		КонецЦикла;
	КонецЕсли;

	// Имя «Обработки» занято менеджером обработок конфигурации: присваивание в
	// него валится с «Поле объекта недоступно для записи».
	ОписанияОбработок = Манифест.Получить("processings");
	Если ТипЗнч(ОписанияОбработок) = Тип("Массив") Тогда
		Для Каждого ОписаниеОбработки Из ОписанияОбработок Цикл
			Файл = ПрочитатьФайлОбработки(ОписаниеОбработки, КаталогРазбора, Результат);
			Если Файл <> Неопределено Тогда
				Загрузка.ФайлыОбработок.Добавить(Файл);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Загрузка;

КонецФункции

// Файл обработки из пакета: Структура Имя, Данные. Неопределено — файла в
// пакете нет (предупреждение) или он изменен после сборки (ошибка).
Функция ПрочитатьФайлОбработки(Описание, КаталогРазбора, Результат)

	Имя = СокрЛП(Строка(Описание.Получить("name")));
	Путь = КаталогРазбора + ПолучитьРазделительПути() + Строка(Описание.Получить("file"));
	Если Не ФайлСуществует(Путь) Тогда
		Результат.Предупреждения.Добавить("В пакете нет файла обработки «" + Имя + "».");
		Возврат Неопределено;
	КонецЕсли;

	Ожидаемый = НРег(СокрЛП(Строка(Описание.Получить("sha256"))));
	Фактический = ХешФайла(Путь);
	Если ЗначениеЗаполнено(Ожидаемый) И Ожидаемый <> Фактический Тогда
		Результат.Ошибки.Добавить("Контрольная сумма обработки «" + Имя + "» не совпала:"
			+ " файл изменен после сборки пакета.");
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("Имя,Данные", Имя, Новый ДвоичныеДанные(Путь));

КонецФункции

// Запись — одной транзакцией: пакет ложится целиком или не ложится совсем.
// Без нее сбой на пятом объекте оставил бы в базе четыре первых — половину
// настройки. В транзакции только база: файлы прочитаны до нее, фоновых
// заданий и обращений к внешним сервисам запись не делает.
Процедура ЗагрузитьСодержимое(Манифест, Загрузка, Результат)

	НачатьТранзакцию();
	Попытка
		ЗаписатьСодержимое(Манифест, Загрузка, Результат);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Исключения здесь не перехватываются: после сбоя записи транзакцию все равно
// не зафиксировать, а настоящую причину отказа заслонила бы ошибка фиксации.
Процедура ЗаписатьСодержимое(Манифест, Загрузка, Результат)

	СоответствиеКарт = Новый Соответствие;
	Карты = Манифест.Получить("extraction_maps");
	Если ТипЗнч(Карты) = Тип("Массив") Тогда
		Для Каждого Карта Из Карты Цикл
			Загрузка.Шаг = "карту «" + СокрЛП(Строка(Карта.Получить("name"))) + "»";
			Ссылка = ЗагрузитьКарту(Карта, Результат);
			Если Ссылка <> Неопределено Тогда
				СоответствиеКарт.Вставить(Строка(Карта.Получить("name")), Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Для Каждого Файл Из Загрузка.ФайлыОбработок Цикл
		Загрузка.Шаг = "файл обработки «" + Файл.Имя + "»";
		ЗагрузитьОбработку(Файл, Результат);
	КонецЦикла;

	Места = Манифест.Получить("launch_places");
	Загруженные = Новый Массив;
	Для Каждого Место Из Места Цикл
		Загрузка.Шаг = "место запуска «" + СокрЛП(Строка(Место.Получить("name"))) + "»";
		Загруженные.Добавить(ЗагрузитьМесто(Место, СоответствиеКарт, Загрузка, Результат));
	КонецЦикла;

	// Схема ответа живет в сценарии, а переносит ее туда форма карты — загрузка
	// пишет карту объектом, мимо формы. Без переноса модель не спросят о полях:
	// сценарий выглядит рабочим, но ведет себя иначе, — поэтому сбой переноса
	// отменяет загрузку так же, как сбой любой другой записи.
	Для Каждого Место Из Загруженные Цикл
		Если Не ЗначениеЗаполнено(Место.КартаИзвлечения) Или Не ЗначениеЗаполнено(Место.Сценарий) Тогда
			Продолжить;
		КонецЕсли;
		Загрузка.Шаг = СтрШаблон("схему ответа в сценарий «%1»", Место.Сценарий);
		Если AI_ИзвлечениеРеквизитов.ЗаписатьСхемуВСценарий(Место.КартаИзвлечения, Место.Сценарий) Тогда
			Результат.Загружено.Добавить(СтрШаблон("Схема ответа перенесена в сценарий «%1».",
				Место.Сценарий));
		КонецЕсли;
	КонецЦикла;
	Загрузка.Шаг = "пакет";

КонецПроцедуры

// Сценарий несет агента, провайдера и модель — это среда и права, и в пакете их
// нет. Недостающий сценарий создается копией образца, как в мастере нового
// действия: агент и модель — как в образце, настройки ответа — из пакета. Итог
// загрузки говорит об этом прямо: модель, возможно, стоит сменить.
Функция СоздатьСценарийИзПакета(Имя, Загрузка, Результат)

	Если Загрузка.Образец = Неопределено Тогда
		Образец = Неопределено;
		Загрузка.Параметры.Свойство("ОбразецСценария", Образец);
		Если Не ЗначениеЗаполнено(Образец) Тогда
			Образец = Обработки.AI_НовоеДействие.ОбразецПоУмолчанию();
		КонецЕсли;
		Загрузка.Образец = Образец;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Загрузка.Образец) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ШагМеста = Загрузка.Шаг;
	Загрузка.Шаг = "сценарий «" + Имя + "»";
	Ссылка = Обработки.AI_НовоеДействие.СоздатьСценарий(Загрузка.Образец, Имя);
	Описание = Загрузка.ОписанияСценариев.Получить(Имя);
	Если Описание <> Неопределено Тогда
		Сценарий = Ссылка.ПолучитьОбъект();
		Значение = Описание.Получить("handler_code");
		Если Значение <> Неопределено Тогда
			Сценарий.КодОбработчика = Строка(Значение);
		КонецЕсли;
		Значение = Описание.Получить("contract_version");
		Если ЗначениеЗаполнено(Значение) Тогда
			Сценарий.ВерсияКонтракта = Число(Значение);
		КонецЕсли;
		Значение = Описание.Получить("allow_retry");
		Если Значение <> Неопределено Тогда
			Сценарий.РазрешитьПовтор = Булево(Значение);
		КонецЕсли;
		Значение = Описание.Получить("max_attempts");
		Если ЗначениеЗаполнено(Значение) Тогда
			Сценарий.МаксимумПопыток = Число(Значение);
		КонецЕсли;
		Значение = ЗначениеПеречисленияПоИмени("AI_СпособРазбораВложений",
			Строка(Описание.Получить("attachment_parse_mode")));
		Если Значение <> Неопределено Тогда
			Сценарий.СпособРазбораВложений = Значение;
		КонецЕсли;
		Сценарий.Записать();
	КонецЕсли;
	Загрузка.Шаг = ШагМеста;
	Результат.Загружено.Добавить(СтрШаблон("Сценарий «%1» создан по образцу «%2»: агент и модель —"
		+ " как в нем. Проверьте их в сценарии.", Имя, Загрузка.Образец));
	Возврат Ссылка;

КонецФункции

Функция ВерсияСхемыПакета()
	Возврат 2;
КонецФункции

// Zip начинается с «PK»: все остальное считаем голым manifest.json.
Функция ЭтоАрхив(Данные)

	Если Данные.Размер() < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(Данные);
	Возврат Буфер.Получить(0) = 80 И Буфер.Получить(1) = 75;

КонецФункции

Функция ЗагрузитьКарту(Описание, Результат)

	Имя = СокрЛП(Строка(Описание.Получить("name")));
	Ссылка = Справочники.AI_КартыИзвлечения.НайтиПоНаименованию(Имя, Истина);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Карта = Ссылка.ПолучитьОбъект();
		Результат.Загружено.Добавить("Карта обновлена: " + Имя);
	Иначе
		Карта = Справочники.AI_КартыИзвлечения.СоздатьЭлемент();
		Карта.Наименование = Имя;
		Результат.Загружено.Добавить("Карта создана: " + Имя);
	КонецЕсли;

	ПолноеИмя = СокрЛП(Строка(Описание.Получить("metadata_name")));
	Карта.ПолноеИмяМетаданных = ПолноеИмя;
	Карта.Описание = Строка(ЗначениеИлиПусто(Описание, "description", ""));
	Карта.ЗаменятьСтрокиТабличныхЧастей = Булево(ЗначениеИлиПусто(Описание, "replace_rows", Ложь));
	Карта.ОбновлятьСтрокиПоНомеру = Булево(ЗначениеИлиПусто(Описание, "update_rows_by_number", Ложь));
	Карта.Активна = Истина;
	Карта.Поля.Очистить();

	// Тип значения, тип ссылки, поиск и название поля автор пакета вправе не
	// писать: их, как и мастер, выводим из метаданных. Ключ ответа выведет
	// сама карта при записи.
	Кандидаты = Неопределено;
	Поля = Описание.Получить("fields");
	Если ТипЗнч(Поля) = Тип("Массив") Тогда
		Для Каждого Поле Из Поля Цикл
			Строка = Карта.Поля.Добавить();
			Строка.Ключ = Строка(ЗначениеИлиПусто(Поле, "key", ""));
			Строка.ПутьРеквизита = СокрЛП(Строка(ЗначениеИлиПусто(Поле, "attribute_path", "")));
			Строка.ТабличнаяЧасть = СокрЛП(Строка(ЗначениеИлиПусто(Поле, "tabular_section", "")));
			Строка.ДополнительныйРеквизит = СокрЛП(Строка(ЗначениеИлиПусто(Поле, "extra_attribute", "")));
			Строка.Обязательное = Булево(ЗначениеИлиПусто(Поле, "required", Ложь));
			Строка.ВыбиратьИзСписка = Булево(ЗначениеИлиПусто(Поле, "choose_from_list", Ложь));
			Строка.Подсказка = Строка(ЗначениеИлиПусто(Поле, "hint", ""));

			Кандидат = Неопределено;
			Если Поле.Получить("value_type") = Неопределено Или Поле.Получить("title") = Неопределено
				Или Поле.Получить("search_by_title") = Неопределено Тогда
				Если Кандидаты = Неопределено Тогда
					Кандидаты = AI_ИзвлечениеРеквизитов.КандидатыПолейКарты(ПолноеИмя, Истина);
				КонецЕсли;
				Кандидат = КандидатПоля(Кандидаты, Строка);
				Если Кандидат = Неопределено И Поле.Получить("value_type") = Неопределено Тогда
					Результат.Предупреждения.Добавить(СтрШаблон("Карта «%1»: для поля «%2» не удалось"
						+ " определить тип значения по метаданным — укажите value_type.",
						Карта.Наименование, ?(ЗначениеЗаполнено(Строка.ТабличнаяЧасть),
							Строка.ТабличнаяЧасть + "." + Строка.ПутьРеквизита, Строка.ПутьРеквизита)));
				КонецЕсли;
			КонецЕсли;

			Если Поле.Получить("value_type") <> Неопределено Тогда
				Строка.ТипЗначения = ЗначениеПеречисленияПоИмени("AI_ТипЗначенияПоля",
					Строка(Поле.Получить("value_type")));
				Строка.ТипСсылки = Строка(ЗначениеИлиПусто(Поле, "reference_type", ""));
			ИначеЕсли Кандидат <> Неопределено Тогда
				Строка.ТипЗначения = Кандидат.ТипЗначения;
				Строка.ТипСсылки = Кандидат.ТипСсылки;
			КонецЕсли;
			Если Поле.Получить("search_by_title") <> Неопределено Тогда
				Строка.ПоискПоНаименованию = Булево(Поле.Получить("search_by_title"));
			ИначеЕсли Кандидат <> Неопределено Тогда
				Строка.ПоискПоНаименованию = Кандидат.ПоискПоНаименованию;
			КонецЕсли;
			Если Поле.Получить("title") <> Неопределено Тогда
				Строка.Представление = Строка(Поле.Получить("title"));
			ИначеЕсли Кандидат <> Неопределено Тогда
				// «Лист согласования: Исполнитель» — для модели лишнее: табличная
				// часть видна по структуре ответа. Так же делает мастер.
				Представление = Кандидат.Представление;
				Если ЗначениеЗаполнено(Строка.ТабличнаяЧасть) И СтрНайти(Представление, ": ") > 0 Тогда
					Представление = Сред(Представление, СтрНайти(Представление, ": ") + 2);
				КонецЕсли;
				Строка.Представление = Представление;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Карта.Записать();
	Возврат Карта.Ссылка;

КонецФункции

// Место запуска приходит неактивным: пакет из чужой базы включает человек,
// посмотрев, что именно он включает.
Функция ЗагрузитьМесто(Описание, СоответствиеКарт, Загрузка, Результат)

	Имя = СокрЛП(Строка(Описание.Получить("name")));
	Ссылка = Справочники.AI_МестаЗапускаСценариев.НайтиПоНаименованию(Имя, Истина);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Место = Ссылка.ПолучитьОбъект();
		Результат.Загружено.Добавить("Место запуска обновлено: " + Имя);
	Иначе
		Место = Справочники.AI_МестаЗапускаСценариев.СоздатьЭлемент();
		Место.Наименование = Имя;
		Результат.Загружено.Добавить("Место запуска создано: " + Имя);
	КонецЕсли;

	Место.Активно = Ложь;
	Место.ТипМеста = Строка(Описание.Получить("place_type"));
	Место.ПолноеИмяМетаданных = Строка(Описание.Получить("metadata_name"));
	Место.ПредставлениеКоманды = Строка(Описание.Получить("command_title"));
	Место.Описание = Строка(Описание.Получить("description"));
	Место.НачальныйЗапрос = Строка(Описание.Получить("initial_prompt"));
	Место.Порядок = Число(?(Описание.Получить("order") = Неопределено, 0, Описание.Получить("order")));
	Место.РазрешитьНесколькоОбъектов = Булево(ЗначениеИлиПусто(Описание, "allow_many", Ложь));
	Место.РежимВыполнения = ЗначениеПеречисленияПоИмени("AI_РежимВыполнения",
		Строка(Описание.Получить("execution_mode")));
	Место.ВидДействия = ЗначениеПеречисленияПоИмени("AI_ВидДействия",
		Строка(Описание.Получить("action_kind")));
	Место.ЗаголовокДействия = Строка(ЗначениеИлиПусто(Описание, "action_title", ""));
	Место.КлючДействия = Строка(ЗначениеИлиПусто(Описание, "action_key", ""));
	Место.Обработчик = Строка(ЗначениеИлиПусто(Описание, "handler", ""));
	Место.МетодДействия = Строка(ЗначениеИлиПусто(Описание, "action_method", ""));
	Место.МетодПроверки = Строка(ЗначениеИлиПусто(Описание, "check_method", ""));
	Место.МетодПодготовкиЗапроса = Строка(ЗначениеИлиПусто(Описание, "prepare_method", ""));
	Место.МетодПослеОтвета = Строка(ЗначениеИлиПусто(Описание, "after_answer_method", ""));
	Место.МетодПослеДействия = Строка(ЗначениеИлиПусто(Описание, "after_action_method", ""));
	Место.РежимДиалога = Булево(ЗначениеИлиПусто(Описание, "dialog_mode", Ложь));

	ИмяКарты = СокрЛП(Строка(Описание.Получить("extraction_map")));
	Если ЗначениеЗаполнено(ИмяКарты) Тогда
		Карта = СоответствиеКарт.Получить(ИмяКарты);
		Если Карта = Неопределено Тогда
			Карта = Справочники.AI_КартыИзвлечения.НайтиПоНаименованию(ИмяКарты, Истина);
		КонецЕсли;
		Если ЗначениеЗаполнено(Карта) Тогда
			Место.КартаИзвлечения = Карта;
		Иначе
			Результат.Предупреждения.Добавить("Карта «" + ИмяКарты + "» не найдена:"
				+ " место запуска «" + Имя + "» осталось без карты.");
		КонецЕсли;
	КонецЕсли;

	ИмяСценария = СокрЛП(Строка(ЗначениеИлиПусто(Описание, "scenario", "")));
	Если ЗначениеЗаполнено(ИмяСценария) Тогда
		Сценарий = Справочники.AI_Сценарии.НайтиПоНаименованию(ИмяСценария, Истина);
		Если Не ЗначениеЗаполнено(Сценарий) Тогда
			Сценарий = СоздатьСценарийИзПакета(ИмяСценария, Загрузка, Результат);
		КонецЕсли;
		Если ЗначениеЗаполнено(Сценарий) Тогда
			Место.Сценарий = Сценарий;
		Иначе
			// Образца нет — значит, в базе нет ни одного рабочего сценария, и
			// агента с моделью взять неоткуда. Тихо оставить пустоту значит
			// отдать место запуска, которое никогда не сработает.
			Результат.Предупреждения.Добавить("Сценария «" + ИмяСценария + "» в базе нет, и создать"
				+ " его не по чему: нет ни одного рабочего сценария с агентом и моделью."
				+ " Создайте сценарий и укажите его в месте запуска «" + Имя + "».");
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьУточнения(Место, Описание);
	ЗаполнитьОтборы(Место, Описание);
	ЗаполнитьПараметры(Место, Описание);
	ЗаполнитьДанныеОбъекта(Место, Описание);
	ЗаполнитьВидимость(Место, Описание, Результат);

	Место.Записать();
	Возврат Место.Ссылка;

КонецФункции

Процедура ЗаполнитьДанныеОбъекта(Место, Описание)

	Место.ДанныеОбъекта.Очистить();
	Строки = Описание.Получить("object_data");
	Если ТипЗнч(Строки) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Строка Из Строки Цикл
		Новая = Место.ДанныеОбъекта.Добавить();
		Новая.ТабличнаяЧасть = СокрЛП(Строка(ЗначениеИлиПусто(Строка, "tabular_section", "")));
		Новая.ПутьРеквизита = СокрЛП(Строка(ЗначениеИлиПусто(Строка, "attribute", "*")));
	КонецЦикла;

КонецПроцедуры

// Роли и группы доступа переносятся именами: в принимающей базе их может не
// быть, и тогда действие не увидит никто — об этом говорим сразу.
Процедура ЗаполнитьВидимость(Место, Описание, Результат)

	Место.Видимость.Очистить();
	Строки = Описание.Получить("visibility");
	Если ТипЗнч(Строки) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Строка Из Строки Цикл
		Новая = Место.Видимость.Добавить();
		Новая.ВидУсловия = СокрЛП(Строка(ЗначениеИлиПусто(Строка, "kind", "")));
		Новая.Имя = СокрЛП(Строка(ЗначениеИлиПусто(Строка, "name", "")));
		Если Новая.ВидУсловия = "Роль" И Метаданные.Роли.Найти(Новая.Имя) = Неопределено Тогда
			Результат.Предупреждения.Добавить(СтрШаблон("Место «%1»: роли «%2» в этой конфигурации нет —"
				+ " по этому условию действие не увидит никто.", Место.Наименование, Новая.Имя));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Значение ключа манифеста или умолчание, если ключа нет: пакет, написанный
// руками или агентом, вправе опускать то, что совпадает с умолчанием.
Функция ЗначениеИлиПусто(Описание, Ключ, ПоУмолчанию)

	Значение = Описание.Получить(Ключ);
	Возврат ?(Значение = Неопределено, ПоУмолчанию, Значение);

КонецФункции

// Кандидат мастера для поля карты: реквизит шапки, колонка табличной части
// или дополнительный реквизит. Неопределено — такого в метаданных нет.
Функция КандидатПоля(Кандидаты, СтрокаКарты)

	Для Каждого Кандидат Из Кандидаты Цикл
		Если ЗначениеЗаполнено(СтрокаКарты.ДополнительныйРеквизит) Тогда
			Если Кандидат.ДополнительныйРеквизит = СтрокаКарты.ДополнительныйРеквизит Тогда
				Возврат Кандидат;
			КонецЕсли;
		ИначеЕсли Кандидат.ТабличнаяЧасть = СтрокаКарты.ТабличнаяЧасть
			И Кандидат.ПутьРеквизита = СтрокаКарты.ПутьРеквизита
			И Не ЗначениеЗаполнено(Кандидат.ДополнительныйРеквизит) Тогда
			Возврат Кандидат;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;

КонецФункции

Процедура ЗаполнитьУточнения(Место, Описание)

	Место.Уточнения.Очистить();
	Уточнения = Описание.Получить("clarifications");
	Если ТипЗнч(Уточнения) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Шаг Из Уточнения Цикл
		Строка = Место.Уточнения.Добавить();
		Строка.Идентификатор = Строка(Шаг.Получить("id"));
		Строка.Представление = Строка(Шаг.Получить("title"));
		Строка.ВидУточнения = ЗначениеПеречисленияПоИмени("AI_ВидУточнения",
			Строка(Шаг.Получить("kind")));
		Строка.ИсточникДанных = Строка(Шаг.Получить("source"));
		Строка.РеквизитСвязи = Строка(Шаг.Получить("link_attribute"));
		Строка.РеквизитПредставления = Строка(Шаг.Получить("title_attribute"));
		Строка.РеквизитСодержимого = Строка(Шаг.Получить("content_attribute"));
		Строка.РеквизитИмениФайла = Строка(Шаг.Получить("file_name_attribute"));
		Строка.ОтборРеквизит = Строка(Шаг.Получить("filter_attribute"));
		Строка.ОтборЗначение = Строка(Шаг.Получить("filter_value"));
		Строка.ПередаватьСодержимое = Булево(ЗначениеИлиПусто(Шаг, "send_content", Ложь));
		Строка.Обязательное = Булево(ЗначениеИлиПусто(Шаг, "required", Ложь));
		Строка.Подсказка = Строка(Шаг.Получить("hint"));
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьОтборы(Место, Описание)

	Место.ОтборыКонтекста.Очистить();
	Отборы = Описание.Получить("context_filters");
	Если ТипЗнч(Отборы) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Отбор Из Отборы Цикл
		Строка = Место.ОтборыКонтекста.Добавить();
		Строка.ПутьРеквизита = Строка(Отбор.Получить("path"));
		Строка.ВидСравнения = ЗначениеПеречисленияПоИмени("AI_ВидСравненияОтбора",
			Строка(Отбор.Получить("comparison")));
		Строка.Значение = Строка(Отбор.Получить("value"));
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПараметры(Место, Описание)

	Место.ПараметрыДействия.Очистить();
	Параметры = Описание.Получить("action_parameters");
	Если ТипЗнч(Параметры) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Параметр Из Параметры Цикл
		Строка = Место.ПараметрыДействия.Добавить();
		Строка.Имя = Строка(Параметр.Получить("name"));
		Строка.ТипЗначения = ЗначениеПеречисленияПоИмени("AI_ТипЗначенияПоля",
			Строка(Параметр.Получить("value_type")));
		Строка.Значение = Строка(Параметр.Получить("value"));
		Строка.ТипСсылки = Строка(Параметр.Получить("reference_type"));
	КонецЦикла;

КонецПроцедуры

// Файл обработки кладется в базу только поверх уже зарегистрированной записи с
// тем же именем. Новую регистрацию подсистема не создает: вид, публикация,
// назначение и команды — это контракт БСП, и заполнять его за администратора
// означало бы подключить чужой код без проверки. Файл при этом не теряется:
// он остается в пакете. Файл — из ПрочитатьФайлОбработки, уже сверенный с
// контрольной суммой.
Процедура ЗагрузитьОбработку(Файл, Результат)

	Имя = Файл.Имя;
	Если Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено Тогда
		Результат.Предупреждения.Добавить("Реестра дополнительных обработок в конфигурации нет:"
			+ " обработку «" + Имя + "» нужно подключить средствами конфигурации.");
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 Обработки.Ссылка КАК Ссылка
		|ИЗ Справочник.ДополнительныеОтчетыИОбработки КАК Обработки
		|ГДЕ НЕ Обработки.ПометкаУдаления
		|  И (Обработки.Наименование = &Имя ИЛИ Обработки.ИмяОбъекта = &Имя)");
	Запрос.УстановитьПараметр("Имя", Имя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Результат.Предупреждения.Добавить("Обработка «" + Имя + "» в базе не зарегистрирована."
			+ " Зарегистрируйте ее в дополнительных отчетах и обработках — файл в пакете есть,"
			+ " но подключать чужой код за администратора подсистема не будет.");
		Возврат;
	КонецЕсли;

	Обработка = Выборка.Ссылка.ПолучитьОбъект();
	Обработка.ХранилищеОбработки = Новый ХранилищеЗначения(Файл.Данные);
	Обработка.Записать();
	Результат.Загружено.Добавить("Файл обработки обновлен: " + Имя);

КонецПроцедуры

Функция ФайлСуществует(Путь)

	Файл = Новый Файл(Путь);
	Возврат Файл.Существует() И Файл.ЭтоФайл();

КонецФункции

Процедура УдалитьКаталогТихо(Путь)

	Попытка
		УдалитьФайлы(Путь);
	Исключение
		// Временный каталог не смертелен: система уберет его сама.
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьВЖурнал(Событие, Текст)

	ЗаписьЖурналаРегистрации(
		"AI.ПакетыСценариев." + Событие,
		УровеньЖурналаРегистрации.Информация,
		,
		,
		Лев(Текст, 1000));

КонецПроцедуры

#КонецОбласти
